# 연속형 확률 분포 pnorm(x, 평균, 표준편차)
1 - pnorm(400, 300, 40)
pnorm(300, 300, 40) - pnorm(250, 300, 40)
pnorm(200, 300, 40)

1 - pnorm(180, 175, 10)
pnorm(175, 175, 10) - pnorm(170, 175, 10)
pnorm(160, 175, 10)

pnorm(160, 250, 30)
1 - pnorm(325, 250, 30)
pnorm(295, 250, 30) - pnorm(220, 250, 30)

# 연속형 확률 분포_연습문제

# 1
pnorm(75, 70, 10)
pnorm(65, 60, 5)

# 2
pnorm(35, 30, 5) - pnorm(25, 30, 5)

# 3
pnorm(3.2, 3.4, 1.2)
1 - pnorm(3.5, 3.4, 1.2)
pnorm(3.5, 3.4, 1.2) - pnorm(3.1, 3.4, 1.2)

# 4
1 - pnorm(110000, 100000, 20000)

# 5
pnorm(5000, 6000, 500)

# 6
1 - pnorm(25, 20, 5)
