# 연속형 확률 분포 pnorm(x, 평균, 표준편차)
1 - pnorm(400, 300, 40)
pnorm(300, 300, 40) - pnorm(250, 300, 40)
pnorm(200, 300, 40)

1 - pnorm(180, 175, 10)
pnorm(175, 175, 10) - pnorm(170, 175, 10)
pnorm(160, 175, 10)

pnorm(160, 250, 30)
1 - pnorm(325, 250, 30)
pnorm(295, 250, 30) - pnorm(220, 250, 30)

# 연속형 확률 분포_연습문제

# 1
pnorm(75, 70, 10)
pnorm(65, 60, 5)

# 2
pnorm(35, 30, 5) - pnorm(25, 30, 5)

# 3
pnorm(3.2, 3.4, 1.2)
1 - pnorm(3.5, 3.4, 1.2)
pnorm(3.5, 3.4, 1.2) - pnorm(3.1, 3.4, 1.2)

# 4
1 - pnorm(110000, 100000, 20000)

# 5
pnorm(5000, 6000, 500)

# 6
1 - pnorm(25, 20, 5)

# 추가 1
pnorm(7.5327196, 10, 1.5)

# 추가 2


# 추가 3
pnorm(15, 12.5, 2) - pnorm(10, 12.5, 2)

#=============================================================#
# 가설 검정

# t 검정 t.test(데이터, 단축검정 or 양측검정, 모집단 평균)
# p-value(1 = 100%)가 유의수준보다 작으면 귀무가설 기각
data <-  c(94.5, 94, 95, 96, 96, 97, 96.5, 98, 95, 96)
t.test(data, alternative = "greater", mu = 95)

data <-  c(85, 65, 100, 100, 90, 90, 75, 95, 95, 100)
t.test(data, alternative = "greater", mu = 90)

# 가설 검정_연습문제

# 7
data <-  c(24000, 26000, 20000, 32000, 33000, 28000, 23000, 25000, 25500, 24000)
t.test(data, alternative = "greater", mu = 25000)

# 8
data <-  c(4.5, 3.5, 3.6, 3.4, 4.2, 4.3, 3.3, 4.5, 3.9, 4.2)
t.test(data, alternative = "greater", mu = 3.5)
